---
kind: method
id: M:Autodesk.Revit.DB.WorksetConfiguration.#ctor(Autodesk.Revit.DB.WorksetConfiguration)
source: html/d86abe9a-6ecd-ea9c-ae35-e793938c1f21.htm
---
# Autodesk.Revit.DB.WorksetConfiguration.#ctor Method

Constructs a new copy of the input WorksetConfiguration object.

## Syntax (C#)
```csharp
public WorksetConfiguration(
	WorksetConfiguration other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.WorksetConfiguration`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null